InformationRegisters/bitmobile_ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>bitmobile_ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлЗаблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bitmobile_НаправленияСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.bitmobile_ДействияПриСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DefaultValues.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>DefaultValues</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Value</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>TypeName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>TabularSection</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Attribute</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/QuestionGroupTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>QuestionGroupTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RegularQuestions</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SKUQuestions</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DataType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>DataType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>String</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Integer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Decimal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Boolean</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DateTime</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ValueList</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Snapshot</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/bitmobile_ДействияПриСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>bitmobile_ДействияПриСинхронизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДобавитьФайл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьФайл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Territory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Territory</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Region</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SR</Name>
					<Comment>Не используется начиная с 30 релиза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Outlets</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Outlet</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Outlet</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SKUGroups</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SKUGroup</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SKUGroup</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Stocks</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Stock</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Stock</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SRs</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SR</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.User</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LineNumberInUser</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/User.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>User</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Manager</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.User</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserID</Name>
					<Comment>Требуется для сопоставления элемента справочника ВнешниеПользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserName</Name>
					<Comment>Для логина выполняется проверка на уникальность в пределах всего справочника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Role</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Position</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Positions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InterfaceLanguage</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoleOfUser</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RolesOfUsers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/CommonProcessors/Ext/Module.bsl
Function GetTerritory(Outlet) Export
	
	Query = New Query;
	
	Query.Text = "SELECT ALLOWED TOP 1
				|	TerritoryOutlets.Ref
				|FROM
				|	Catalog.Territory.Outlets AS TerritoryOutlets
				|WHERE
				|	TerritoryOutlets.Outlet = &Outlet";
	
	Query.SetParameter("Outlet", Outlet);
	
	Selection = Query.Execute().Select();
	Selection.Next();
	
	Return Selection.Ref;	
	
EndFunction

Function GetPredefinedItems(PredefinedItems) Export 
	
	ItemsMap = New Map;
	
	For Each Row In PredefinedItems Do
		
		If Row.Key = "Catalog.User" Then
			
			Query = New Query;
			Query.Text = "SELECT ALLOWED
						|	User.Ref AS Ref
						|FROM
						|	Catalog.User AS User
						|WHERE
						|	User.Role = &Role";
			
			Query.SetParameter("Role", "SR");
			
		Else
			
			Query = New Query;
			Query.Text = "SELECT ALLOWED Ref FROM " + Row.Key;
			
		EndIf;
		
		Result = Query.Execute().Unload();
		
		If Result.Count() = 1 Then
			
			ItemsMap.Insert(Row.Value, Result[0].Ref);
			
		EndIf;
		
	EndDo;
	
	Return ItemsMap;
	
EndFunction

Function GetQuestionGroupType(TypeString = "SKUQuestions") Export
	
	If TypeString = "SKUQuestions" Then 
		
		Return Enums.QuestionGroupTypes.SKUQuestions;
		
	Else 
		
		Return Enums.QuestionGroupTypes.RegularQuestions;
		
	EndIf;
	
EndFunction

Function StringToNumber(String) Export
	
	Try
		
		Result = StrReplace(String, " ", "");
		Result = StrReplace(Result, Chars.NBSp, "");
		
		Result = Number(Result);
		
	Except
		
		Result = 0;
		
	EndTry;
	
	Return Result;
	
EndFunction

Function GetConnectionToServer() Export
	
	// Инициализация подключения
	
	Password = Constants.bitmobile_Пароль.Get();
	Server = StrReplace(Constants.bitmobile_Сервер.Get(), "localhost", "127.0.0.1");
	Port = Constants.bitmobile_Порт.Get();
	
	DefaultPort 		= 	Undefined;
	SecureConnection 	= 	Undefined;
	
	If Constants.bitmobile_ИспользуетсяHTTPS.Get() Then
		DefaultPort 		= 	443;
		SecureConnection 	= 	New OpenSSLSecureConnection(Undefined, Undefined);
	Else
		DefaultPort 		= 	80;
		SecureConnection 	= 	Undefined;
	EndIf;
	
	If Not ValueIsFilled(Port) Then 
		
		Port = DefaultPort;
		
	EndIf;;

	
	Try
		
		Return New HTTPConnection(Server, ?(Port = 0, 80, Port), "admin", Password,,,SecureConnection);
		
	Except
		
		Return Undefined;
		
	EndTry;
	
EndFunction

Function GetWebDAVPathOnServer() Export
	
	Path = Constants.bitmobile_ПутьНаСервере.Get();
	
	Return StrReplace(Path, "admin/", "webdav");
	
EndFunction

Function GetSnapshot(FileUUID, FormUUID, NameForFile) Export
	
	If ValueIsFilled(FileUUID) Then
		
		// Убрать запрещенные символы из имени файла
		NameForFile = PrepareFileName(NameForFile);
		
		Try
			
			If TypeOf(FileUUID) = Type("String") Then 
				
				ShapshotUUID = New UUID(FileUUID);
				
			Else 
				
				ShapshotUUID = FileUUID;
				
			EndIf;
			
			// Ищем данные о файле
			FileRow = InformationRegisters.bitmobile_ХранилищеФайлов.Select(New Structure("ИмяФайла", ShapshotUUID));
			
			// Если найден уид в таблице файлов
			If FileRow.Next() Then
				
				Connection = CommonProcessors.GetConnectionToServer();
				
				Path = CommonProcessors.GetWebDAVPathOnServer();
				
				// Забираем бинарные данные из таблицы файлов
				BinaryDataOfFile = FileRow.Хранилище.Get();
				
				// Если бинарные данные есть
				If ValueIsFilled(BinaryDataOfFile) Then
					
					ReturnStructure = New Structure("SnapshotAddress, SnapshotName", PutToTempStorage(BinaryDataOfFile, FormUUID), NameForFile + FileRow.Расширение);
					
					Return ReturnStructure;
					
				// Если нет бинарных данных
				Else
					
					// Если соединение было создано успешно
					If Not Connection = Undefined Then
						
						// Пробуем забрать файл
						Try
							
							WebDAVFile = GetTempFileName(FileRow.Расширение);
							
							Connection.Get(Path + FileRow.ПолноеИмяФайла, WebDAVFile);
							
							BinaryDataOfFile = New BinaryData(WebDAVFile);
							
							ReturnStructure = New Structure("SnapshotAddress, SnapshotName", PutToTempStorage(BinaryDataOfFile, FormUUID), NameForFile + FileRow.Расширение);
							
							Return ReturnStructure;
							
						Except
						EndTry;
						
					EndIf;
					
				EndIf;
				
			EndIf;
			
		Except
		EndTry;
		
	EndIf;
	
	Return Undefined;
	
EndFunction

Function PrepareFileName(FileName)
	
	FileName = StrReplace(FileName, "/", "");
	FileName = StrReplace(FileName, "\", "");
	FileName = StrReplace(FileName, "|", "");
	FileName = StrReplace(FileName, ":", "");
	FileName = StrReplace(FileName, "*", "");
	FileName = StrReplace(FileName, """", "");
	FileName = StrReplace(FileName, "<", "");
	FileName = StrReplace(FileName, ">", "");
	FileName = StrReplace(FileName, "?", "");
	
	Return FileName;
	
EndFunction

Procedure FillDefaultValues_DocumentBeforeWrite(Source, Cancel, WriteMode, PostingMode) Export
	
	If Source.DataExchange.Load Or Source.AdditionalProperties.Property("FillDefaultValues") Then 
		
		FillDefaultValues(Source, Source.AdditionalProperties.Property("ЗагрузкаBitmobile"));
		
	EndIf;
	
EndProcedure

Procedure FillDefaultValues_CatalogBeforeWrite(Source, Cancel) Export
	
	If Source.DataExchange.Load Or Source.AdditionalProperties.Property("FillDefaultValues") Then 
		
		FillDefaultValues(Source, Source.AdditionalProperties.Property("ЗагрузкаBitmobile"));
		
	EndIf;
	
EndProcedure

Procedure FillDefaultValues(Source, IsBMLoad)
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	DefaultValues.Object AS Object,
		|	DefaultValues.TabularSection AS TabularSection,
		|	DefaultValues.Attribute AS Attribute,
		|	DefaultValues.Value,
		|	DefaultValues.TypeName
		|FROM
		|	InformationRegister.DefaultValues AS DefaultValues
		|WHERE
		|	DefaultValues.Object = &ObjectName
		|
		|ORDER BY
		|	Object,
		|	TabularSection,
		|	Attribute";
	
	Query.SetParameter("ObjectName", Source.Metadata().Name);
	
	DefaultValuesTable = Query.Execute().Unload();
	
	TabularSectionsTable = DefaultValuesTable.Copy();
	
	TabularSectionsTable.GroupBy("TabularSection");
	
	For Each TabularSectionsRow In TabularSectionsTable Do 
		
		ProcessedData = DefaultValuesTable.FindRows(New Structure("TabularSection", TabularSectionsRow.TabularSection));
		
		If ValueIsFilled(TabularSectionsRow.TabularSection) Then // TS attributes 
			
			For Each TSItem In Source[TabularSectionsRow.TabularSection] Do 
				
				For Each ProcessedValue In ProcessedData Do  
				
					If ValueIsFilled(ProcessedValue.Value) And Not ValueIsFilled(TSItem[ProcessedValue.Attribute]) Then 
						
						Try
							
							TSItem[ProcessedValue.Attribute] = ProcessedValue.Value;
							
						Except
						
						EndTry;
						
						If IsBMLoad Then 
							
							Source.AdditionalProperties.Delete("ЗагрузкаBitmobile");
							
							IsBMLoad = False;
							
						EndIf;
						
					EndIf;
					
				EndDo;
				
			EndDo;
			
		Else // Object attributes
			
			For Each ProcessedValue In ProcessedData Do  
				
				If ValueIsFilled(ProcessedValue.Value) And Not ValueIsFilled(Source[ProcessedValue.Attribute]) Then 
					
					Try
						
						Source[ProcessedValue.Attribute] = ProcessedValue.Value;
						
					Except
					
					EndTry;
					
					If IsBMLoad Then 
						
						Source.AdditionalProperties.Delete("ЗагрузкаBitmobile");
						
						IsBMLoad = False;
						
					EndIf;
					
				EndIf;
				
			EndDo;
			
		EndIf;
		
	EndDo;
	
EndProcedure

Procedure FillDefaultValuesInformationRegister() Export
	
	// Save old data
	Query = New Query;
	Query.Text = 
		"SELECT
		|	DefaultValues.Object,
		|	DefaultValues.TabularSection,
		|	DefaultValues.Attribute,
		|	DefaultValues.TypeName,
		|	DefaultValues.Value
		|FROM
		|	InformationRegister.DefaultValues AS DefaultValues";
	
	OldValues = Query.Execute().Unload();
	
	// Clear register
	RecordSet = InformationRegisters.DefaultValues.CreateRecordSet();
	RecordSet.Write();
	
	// Fill catalogs
	ReadMetadataCollection(Metadata.Catalogs, OldValues);
	
	// Fill documents
	ReadMetadataCollection(Metadata.Documents, OldValues);
	
EndProcedure

Procedure ReadMetadataCollection(Collection, OldValues) 
	
	For Each ItemMetadata In Collection Do 
		
		If ItemMetadata.Name = "MobileAppSettings"
			Or ItemMetadata.Name = "bitmobile_НастройкиСинхронизации"
			Or ItemMetadata.Name = "OutletsPrimaryParametersSettings"
			Or ItemMetadata.Name = "SystemObjects"
			Or ItemMetadata.Name = "RolesOfUsers"
			Or ItemMetadata.Name = "MobileAppAccessRights"
			Or ItemMetadata.Name = "AdditionalAccessRights" 
			Or ItemMetadata.Name = "Guestbook"
			Or ItemMetadata.Name = "VisitPlan" 
			Or ItemMetadata.Name = "Questionnaire" Then 
			
			Continue;
			
		EndIf;
		
		For Each AttrItem In ItemMetadata.StandardAttributes Do 
			
			If AttrItem.FillChecking = FillChecking.ShowError Then 
				
				NewRecord					= InformationRegisters.DefaultValues.CreateRecordManager();
				NewRecord.Object			= ItemMetadata.Name;
				NewRecord.TabularSection	= "";
				NewRecord.Attribute			= AttrItem.Name;
				
				For Each TypeItem In AttrItem.Type.Types() Do 
					
					NewRecord.TypeName		=  NewRecord.TypeName + GetTypeName(TypeItem) + ",";
					
				EndDo;
				
				NewRecord.TypeName			= Left(NewRecord.TypeName, StrLen(NewRecord.TypeName) - 1);				
				NewRecord.Value				= GetValue(NewRecord, OldValues);
				
				NewRecord.Write();
				
			EndIf;
			
		EndDo;
		
		For Each AttrItem In ItemMetadata.Attributes Do 
			
			If ItemMetadata.Name = "User" And AttrItem.Name = "UserName" Then 
				
				Continue;
				
			EndIf;
			
			If AttrItem.FillChecking = FillChecking.ShowError Then 
				
				NewRecord					= InformationRegisters.DefaultValues.CreateRecordManager();
				NewRecord.Object			= ItemMetadata.Name;
				NewRecord.TabularSection	= "";
				NewRecord.Attribute			= AttrItem.Name;
				
				For Each TypeItem In AttrItem.Type.Types() Do 
					
					NewRecord.TypeName		=  NewRecord.TypeName + GetTypeName(TypeItem) + ",";
					
				EndDo;
				
				NewRecord.TypeName			= Left(NewRecord.TypeName, StrLen(NewRecord.TypeName) - 1);
				NewRecord.Value				= GetValue(NewRecord, OldValues);
				
				NewRecord.Write();
				
			EndIf;
			
		EndDo;
		
		For Each TSItem In ItemMetadata.TabularSections Do 
			
			If ItemMetadata.Name = "VisitPlan" And TSItem.Name = "Outlets" Then 
			
				Continue;
				
			EndIf;
			
			For Each AttrItem In TSItem.Attributes Do
			
				If AttrItem.FillChecking = FillChecking.ShowError Then 
					
					NewRecord					= InformationRegisters.DefaultValues.CreateRecordManager();
					NewRecord.Object			= ItemMetadata.Name;
					NewRecord.TabularSection	= TSItem.Name;
					NewRecord.Attribute			= AttrItem.Name;
					
					For Each TypeItem In AttrItem.Type.Types() Do 
						
						NewRecord.TypeName		=  NewRecord.TypeName + GetTypeName(TypeItem) + ",";
						
					EndDo;
					
					NewRecord.TypeName			= Left(NewRecord.TypeName, StrLen(NewRecord.TypeName) - 1);
					NewRecord.Value				= GetValue(NewRecord, OldValues);
					
					NewRecord.Write();
					
				EndIf;
				
			EndDo;
			
		EndDo;
		
	EndDo;
	
EndProcedure

Function GetValue(NewRecord, OldValues)
	
	FoundStructure = New Structure("Object, TabularSection, Attribute, TypeName", NewRecord.Object, NewRecord.TabularSection, NewRecord.Attribute, NewRecord.TypeName);
	
	FoundedRows = OldValues.FindRows(FoundStructure);
	
	If FoundedRows.Count() = 0 Then 
		
		Return Undefined;
		
	Else 
		
		Return FoundedRows[0].Value;
		
	EndIf;
	
EndFunction

Function GetTypeName(mType)
	
	MetadataOfType = Metadata.FindByType(mType);
	
	If MetadataOfType = Undefined Then  
		
		Return mType;
		
	Else 
		
		FullTypeName = MetadataOfType.FullName();
		
		DotPosition = Find(FullTypeName, ".");
		
		LeftPart = Left(FullTypeName, DotPosition - 1);
		
		FullTypeName = StrReplace(FullTypeName, LeftPart, LeftPart + "Ref"); 
		
		Return FullTypeName;
		
	EndIf;
	
EndFunction

Procedure CheckSnapshots(Source, Cancel) Export
	
	If TypeOf(Source) = Type("CatalogObject.Outlet") Then 
		
		FilesArray = New Array;
		
		// Получить массив актуальных файлов для ТТ
		For Each StrParameter In Source.Parameters Do 
			
			If StrParameter.Parameter.DataType = Enums.DataType.Snapshot And ValueIsFilled(StrParameter.Value) Then 
				
				Try
					
					SnapshotUUID = New UUID(StrParameter.Value);
					
					FilesArray.Add(SnapshotUUID);
					
				Except
					
				EndTry;
				
			EndIf;
			
		EndDo;
		
		For Each StrSnapshot In Source.Snapshots Do 
			
			If ValueIsFilled(StrSnapshot.FileName) Then 
				
				Try
					
					SnapshotUUID = New UUID(StrSnapshot.FileName);
					
					FilesArray.Add(SnapshotUUID);
					
				Except
					
				EndTry;
				
			EndIf;
			
		EndDo;
		
		DeleteIncorrectFiles(Source.Ref, FilesArray);
		
	ElsIf TypeOf(Source) = Type("CatalogObject.SKU") Then
		
		FilesArray = New Array;
		
		If ValueIsFilled(Source.DefaultPicture) Then 
			
			FilesArray.Add(Source.DefaultPicture);
			
		EndIf;
		
		DeleteIncorrectFiles(Source.Ref, FilesArray); 
		
	EndIf;
	
EndProcedure

Procedure DeleteIncorrectFiles(Ref, CorrectFilesArray)
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	bitmobile_ХранилищеФайлов.Объект,
		|	bitmobile_ХранилищеФайлов.НаправлениеСинхронизации,
		|	bitmobile_ХранилищеФайлов.Действие,
		|	bitmobile_ХранилищеФайлов.ИмяФайла,
		|	bitmobile_ХранилищеФайлов.ПолноеИмяФайла,
		|	bitmobile_ХранилищеФайлов.Расширение,
		|	bitmobile_ХранилищеФайлов.Хранилище,
		|	bitmobile_ХранилищеФайлов.ФайлЗаблокирован
		|FROM
		|	InformationRegister.bitmobile_ХранилищеФайлов AS bitmobile_ХранилищеФайлов
		|WHERE
		|	bitmobile_ХранилищеФайлов.ФайлЗаблокирован = FALSE
		|	AND bitmobile_ХранилищеФайлов.Объект = &Ref
		|	AND NOT bitmobile_ХранилищеФайлов.ИмяФайла IN (&CorrectFilesArray)";
	
	Query.SetParameter("CorrectFilesArray", CorrectFilesArray);
	Query.SetParameter("Ref", Ref);
	
	QueryResult = Query.Execute();
	
	Selection = QueryResult.Select();
	
	While Selection.Next() Do
		
		If Selection.Действие = Enums.bitmobile_ДействияПриСинхронизации.EmptyRef() Then 
			
			RecordManager = InformationRegisters.bitmobile_ХранилищеФайлов.CreateRecordManager();
			
			FillPropertyValues(RecordManager, Selection);
			
			RecordManager.Read();
		
			If RecordManager.Selected() Then
				
				RecordManager.Действие = Enums.bitmobile_ДействияПриСинхронизации.УдалитьФайл;
				
				RecordManager.Write();
				
			EndIf;
			
		ElsIf Selection.Действие = Enums.bitmobile_ДействияПриСинхронизации.ДобавитьФайл Then
			
			RecordManager = InformationRegisters.bitmobile_ХранилищеФайлов.CreateRecordManager();
			
			FillPropertyValues(RecordManager, Selection);
			
			RecordManager.Read();
			
			If RecordManager.Selected() Then
				
				RecordManager.Delete();
				
			EndIf;
			
		EndIf;
		
	EndDo;
	
EndProcedure
